#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.prometheus-operator will be created
  + resource "helm_release" "prometheus-operator" {
      + atomic                     = false
      + chart                      = "prometheus-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus-operator"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<~EOT
                ---
                alertmanager:
                  ingress:
                    enabled: true
                    paths: ["/"]
                    hosts:
                      - alertmanager.team1.kia
                  config:
                    global:
                      resolve_timeout: 5m
                      slack_api_url: 'https://hooks.slack.com/services/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'
                    route:
                      group_by: ['job']
                      group_wait: 30s
                      group_interval: 5m
                      repeat_interval: 12h
                      receiver: 'slack-notifications'
                    receivers:
                    - name: 'slack-notifications'
                      slack_configs:
                      - channel: '#devops-training-team1'
                        send_resolved: true
                
                prometheus:
                  ingress:
                    enabled: true
                    paths: ["/"]
                    hosts:
                      - prometheus.team1.kia
                  additionalServiceMonitors:
                    - name: istio
                      selector: {}
                      matchExpressions:
                        - {key: istio, operator: In, values: [pilot, mixer]}
                      namespaceSelector:
                        matchNames:
                          - monitoring
                      jobLabel: istio
                      endpoints:
                        - port: prometheus
                          interval: 5s
                        - port: http-monitoring
                          interval: 5s
                        - port: statsd-prom
                          interval: 5s
                  prometheusSpec:
                    externalUrl: ""
                    routePrefix: /
                    retention: 30d
                    additionalScrapeConfigs:
                      - job_name: 'envoy-stats'
                        metrics_path: /stats/prometheus
                        kubernetes_sd_configs:
                          - role: pod
                        relabel_configs:
                          - source_labels: [__meta_kubernetes_pod_container_port_name]
                            action: keep
                            regex: '.*-envoy-prom'
                          - source_labels: [__address__, __meta_kubernetes_pod_annotation_prometheus_io_port]
                            action: replace
                            regex: ([^:]+)(?::\d+)?;(\d+)
                            replacement: $1:15090
                            target_label: __address__
                          - action: labelmap
                            regex: __meta_kubernetes_pod_label_(.+)
                          - source_labels: [__meta_kubernetes_namespace]
                            action: replace
                            target_label: namespace
                          - source_labels: [__meta_kubernetes_pod_name]
                            action: replace
                            target_label: pod_name
                    ruleNamespaceSelector: {}
                    serviceMonitorSelector:
                      matchLabels:
                        prometheus: default
                    ruleSelector:
                      matchLabels:
                        alertmanager: default
                 
                grafana:
                  ingress:
                    enabled: true
                    path: "/"
                    hosts:
                      - grafana.team1.kia
            EOT,
        ]
      + verify                     = false
      + version                    = "8.13.8"
      + wait                       = true
    }

  # kubernetes_namespace.prometheus will be created
  + resource "kubernetes_namespace" "prometheus" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave3`, Workspace: `default`*
